{"format": "layers-model", "generatedBy": "keras v2.0.5", "convertedBy": "TensorFlow.js Converter v2.6.0", "modelTopology": {"keras_version": "2.0.5", "backend": "tensorflow", "model_config": {"class_name": "Model", "config": {"name": "model_1", "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"batch_input_shape": [null, 64, 64, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"class_name": "Conv2D", "name": "conv2d_1", "config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": false, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_1", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_1", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_1", "config": {"name": "activation_1", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_2", "config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": false, "filters": 8, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_2", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "valid", "kernel_regularizer": {"class_name": "L1L2", "config": {"l1": 0.0, "l2": 0.009999999776482582}}, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["activation_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_2", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_2", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_2", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_1", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_1", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 16}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_4", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_1", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_3", "config": {"name": "activation_3", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_2", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_2", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 16}, "inbound_nodes": [[["activation_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_5", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_5", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_2", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_3", "config": {"kernel_size": [1, 1], "bias_constraint": null, "use_bias": false, "filters": 16, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_3", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["activation_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_1", "config": {"pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_3", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_3", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_1", "config": {"name": "add_1", "trainable": true}, "inbound_nodes": [[["max_pooling2d_1", 0, 0, {}], ["batch_normalization_3", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_3", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_3", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 32}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_7", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_3", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_4", "config": {"name": "activation_4", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_4", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_4", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 32}, "inbound_nodes": [[["activation_4", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_8", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_4", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_4", "config": {"kernel_size": [1, 1], "bias_constraint": null, "use_bias": false, "filters": 32, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_4", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["add_1", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_2", "config": {"pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_6", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_6", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_4", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_2", "config": {"name": "add_2", "trainable": true}, "inbound_nodes": [[["max_pooling2d_2", 0, 0, {}], ["batch_normalization_6", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_5", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_5", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 64}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_10", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_10", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_5", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_10", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_6", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_6", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 64}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_11", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_11", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_6", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_5", "config": {"kernel_size": [1, 1], "bias_constraint": null, "use_bias": false, "filters": 64, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_5", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["add_2", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_3", "config": {"pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["batch_normalization_11", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_9", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_9", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_5", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_3", "config": {"name": "add_3", "trainable": true}, "inbound_nodes": [[["max_pooling2d_3", 0, 0, {}], ["batch_normalization_9", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_7", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_7", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 128}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_13", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_13", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_13", 0, 0, {}]]]}, {"class_name": "SeparableConv2D", "name": "separable_conv2d_8", "config": {"kernel_size": [3, 3], "pointwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "strides": [1, 1], "pointwise_regularizer": null, "depthwise_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "pointwise_constraint": null, "depthwise_constraint": null, "name": "separable_conv2d_8", "use_bias": false, "activity_regularizer": null, "bias_constraint": null, "padding": "same", "depth_multiplier": 1, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "depthwise_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "linear", "filters": 128}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_14", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_14", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["separable_conv2d_8", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_6", "config": {"kernel_size": [1, 1], "bias_constraint": null, "use_bias": false, "filters": 128, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_6", "strides": [2, 2], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["add_3", 0, 0, {}]]]}, {"class_name": "MaxPooling2D", "name": "max_pooling2d_4", "config": {"pool_size": [3, 3], "trainable": true, "name": "max_pooling2d_4", "strides": [2, 2], "data_format": "channels_last", "padding": "same"}, "inbound_nodes": [[["batch_normalization_14", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_12", "config": {"center": true, "axis": -1, "gamma_regularizer": null, "name": "batch_normalization_12", "gamma_initializer": {"class_name": "Ones", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "beta_constraint": null, "trainable": true, "epsilon": 0.001, "momentum": 0.99, "gamma_constraint": null}, "inbound_nodes": [[["conv2d_6", 0, 0, {}]]]}, {"class_name": "Add", "name": "add_4", "config": {"name": "add_4", "trainable": true}, "inbound_nodes": [[["max_pooling2d_4", 0, 0, {}], ["batch_normalization_12", 0, 0, {}]]]}, {"class_name": "Conv2D", "name": "conv2d_7", "config": {"kernel_size": [3, 3], "bias_constraint": null, "use_bias": true, "filters": 7, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "conv2d_7", "strides": [1, 1], "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "seed": null, "scale": 1.0, "distribution": "uniform"}}, "padding": "same", "kernel_regularizer": null, "trainable": true, "data_format": "channels_last", "dilation_rate": [1, 1], "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear"}, "inbound_nodes": [[["add_4", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "name": "global_average_pooling2d_1", "config": {"name": "global_average_pooling2d_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["conv2d_7", 0, 0, {}]]]}, {"class_name": "Activation", "name": "predictions", "config": {"name": "predictions", "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]]}], "output_layers": [["predictions", 0, 0]], "input_layers": [["input_1", 0, 0]]}}, "training_config": {"loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"lr": 0.00010000000474974513, "beta_1": 0.8999999761581421, "epsilon": 1e-08, "beta_2": 0.9990000128746033, "decay": 0.0}}, "loss": "categorical_crossentropy", "metrics": ["accuracy"], "sample_weight_mode": null}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization_1/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_1/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_1/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_1/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_10/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_10/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_11/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_12/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_12/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_13/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_14/gamma", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_14/beta", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_14/moving_mean", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_14/moving_variance", "shape": [128], "dtype": "float32"}, {"name": "batch_normalization_2/gamma", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_2/beta", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_2/moving_mean", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_2/moving_variance", "shape": [8], "dtype": "float32"}, {"name": "batch_normalization_3/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_3/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_3/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_3/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_4/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_4/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_4/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_4/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_5/gamma", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_5/beta", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_5/moving_mean", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_5/moving_variance", "shape": [16], "dtype": "float32"}, {"name": "batch_normalization_6/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_6/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_6/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_6/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_7/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/gamma", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/beta", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/moving_mean", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_8/moving_variance", "shape": [32], "dtype": "float32"}, {"name": "batch_normalization_9/gamma", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_9/beta", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_9/moving_mean", "shape": [64], "dtype": "float32"}, {"name": "batch_normalization_9/moving_variance", "shape": [64], "dtype": "float32"}, {"name": "conv2d_1/kernel", "shape": [3, 3, 1, 8], "dtype": "float32"}, {"name": "conv2d_2/kernel", "shape": [3, 3, 8, 8], "dtype": "float32"}, {"name": "conv2d_3/kernel", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "conv2d_4/kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "conv2d_5/kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "conv2d_6/kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "conv2d_7/kernel", "shape": [3, 3, 128, 7], "dtype": "float32"}, {"name": "conv2d_7/bias", "shape": [7], "dtype": "float32"}, {"name": "separable_conv2d_1/depthwise_kernel", "shape": [3, 3, 8, 1], "dtype": "float32"}, {"name": "separable_conv2d_1/pointwise_kernel", "shape": [1, 1, 8, 16], "dtype": "float32"}, {"name": "separable_conv2d_2/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "separable_conv2d_2/pointwise_kernel", "shape": [1, 1, 16, 16], "dtype": "float32"}, {"name": "separable_conv2d_3/depthwise_kernel", "shape": [3, 3, 16, 1], "dtype": "float32"}, {"name": "separable_conv2d_3/pointwise_kernel", "shape": [1, 1, 16, 32], "dtype": "float32"}, {"name": "separable_conv2d_4/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "separable_conv2d_4/pointwise_kernel", "shape": [1, 1, 32, 32], "dtype": "float32"}, {"name": "separable_conv2d_5/depthwise_kernel", "shape": [3, 3, 32, 1], "dtype": "float32"}, {"name": "separable_conv2d_5/pointwise_kernel", "shape": [1, 1, 32, 64], "dtype": "float32"}, {"name": "separable_conv2d_6/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "separable_conv2d_6/pointwise_kernel", "shape": [1, 1, 64, 64], "dtype": "float32"}, {"name": "separable_conv2d_7/depthwise_kernel", "shape": [3, 3, 64, 1], "dtype": "float32"}, {"name": "separable_conv2d_7/pointwise_kernel", "shape": [1, 1, 64, 128], "dtype": "float32"}, {"name": "separable_conv2d_8/depthwise_kernel", "shape": [3, 3, 128, 1], "dtype": "float32"}, {"name": "separable_conv2d_8/pointwise_kernel", "shape": [1, 1, 128, 128], "dtype": "float32"}]}]}